Tekla Open API Reference for Tekla Structures 2025
AnalysisMaterial Methods
The AnalysisMaterial type exposes the following members.
Methods
Name | Description
Select
 Selects an analysis material. The AnalysisModelName and Name have to be set.
 (Overrides AnalysisObject.Select().)
Top
See Also
Reference
AnalysisMaterial Class
Tekla.Structures.Analysis Namespace